rolling_resistance = {
    # Таблица определения коэффициента сопротивления качению
    # в соответствии с типом дороги
    'Асфальтовая': 0.018, 'Бетонная': 0.015, 'Гравийная': 0.025,
    'Гравийно-щебеночная': 0.03, 'Грунтовая сух. укатанная': 0.035,
    'Грунтовая влажная': 0.15, 'Грунтовая в распутицу': 0.25,
    'Лежневая': 0.03, 'Снежная укатанная': 0.04, 'Снежная': 0.25,
    'Снежная обледенелая': 0.03, 'Песок сухой': 0.3, 'Песок влажный': 0.15
}

adhesion = {
    # Таблица определения коэффициента сцепления
    # в соответствии с состоянием дороги
    'Асфальтовая сухая': 0.8, 'Асфальтовая мокрая': 0.5,
    'Асфальтовая, покрытая грязью': 0.3, 'Асфальтовая, покрытая снегом до 5 см': 0.4,
    'Гравийная сухая': 0.5, 'Гравийная мокрая': 0.4, 'Грунтовая сухая': 0.6,
    'Грунтовая мокрая': 0.4, 'Грунтовая в распутицу': 0.3, 'Лежневая сухая': 0.5,
    'Лежневая мокрая': 0.4, 'Снежная укатанная': 0.35, 'Снежная обледенелая': 0.3,
    'Песок сухой': 0.3, 'Песок влажный': 0.5
}

