# Характеристики шин

# pic_type - тип рисунка
# mpl (maximum permissible load - максимально допустимая нагрузка) [кН]
# od (outside diameter - наружный диаметр) [мм]
# sr (static radius - статический радиус) [мм]
# delta - коэффициент деформации, зависящий от типа рисунка шины

type_240_508_P = {
    'pic_type': 'универс',
    'delta': 0.95,
    'mpl': 15,
    'od': 976,
    'sr': 460
}

type_260_508_P = {
    'pic_type': 'универс',
    'delta': 0.95,
    'mpl': 18.6,
    'od': 1016,
    'sr': 472
}

type_280_508 = {
    'pic_type': 'дорож',
    'delta': 0.93,
    'mpl': 20.8,
    'od': 1070,
    'sr': 500
}

type_300_508 = {
    'pic_type': 'дорож',
    'delta': 0.93,
    'mpl': 23.5,
    'od': 1080,
    'sr': 510
}

type_320_508 = {
    'pic_type': 'повыш прох',
    'delta': 0.97,
    'mpl': 22,
    'od': 1140,
    'sr': 533
}

type_320_508_P = {
    'pic_type': 'универс',
    'delta': 0.95,
    'mpl': 27.3,
    'od': 1146,
    'sr': 542
}

type_370_508 = {
    'pic_type': 'повыш прох',
    'delta': 0.97,
    'mpl': 38,
    'od': 1230,
    'sr': 562
}

type_1100_400_533 = {
    'pic_type': 'повыш прох',
    'delta': 0.97,
    'mpl': 27,
    'od': 1195,
    'sr': 500
}

type_1300_530_533 = {
    'pic_type': 'повыш прох',
    'delta': 0.97,
    'mpl': 40,
    'od': 1280,
    'sr': 585
}

tyres_dict = {
    '240-508P': type_240_508_P,
    '260-508P': type_260_508_P,
    '280-508': type_280_508,
    '300-508': type_300_508,
    '320-508': type_320_508,
    '320-508P': type_320_508_P,
    '370-508': type_370_508,
    '1100-400-533': type_1100_400_533,
    '1300-530-533': type_1300_530_533,
}